results/run-30vu.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: script.js
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 30 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 30 VUs  0m01.0s/1m0s

running (0m02.0s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 30 VUs  0m02.0s/1m0s

running (0m03.0s), 30/30 VUs, 30 complete and 0 interrupted iterations
default   [   5% ] 30 VUs  0m03.0s/1m0s

running (0m04.0s), 30/30 VUs, 60 complete and 0 interrupted iterations
default   [   7% ] 30 VUs  0m04.0s/1m0s

running (0m05.0s), 30/30 VUs, 61 complete and 0 interrupted iterations
default   [   8% ] 30 VUs  0m05.0s/1m0s

running (0m06.0s), 30/30 VUs, 90 complete and 0 interrupted iterations
default   [  10% ] 30 VUs  0m06.0s/1m0s

running (0m07.0s), 30/30 VUs, 120 complete and 0 interrupted iterations
default   [  12% ] 30 VUs  0m07.0s/1m0s

running (0m08.0s), 30/30 VUs, 150 complete and 0 interrupted iterations
default   [  13% ] 30 VUs  0m08.0s/1m0s

running (0m09.0s), 30/30 VUs, 151 complete and 0 interrupted iterations
default   [  15% ] 30 VUs  0m09.0s/1m0s

running (0m10.0s), 30/30 VUs, 180 complete and 0 interrupted iterations
default   [  17% ] 30 VUs  0m10.0s/1m0s

running (0m11.0s), 30/30 VUs, 210 complete and 0 interrupted iterations
default   [  18% ] 30 VUs  0m11.0s/1m0s

running (0m12.0s), 30/30 VUs, 240 complete and 0 interrupted iterations
default   [  20% ] 30 VUs  0m12.0s/1m0s

running (0m13.0s), 30/30 VUs, 270 complete and 0 interrupted iterations
default   [  22% ] 30 VUs  0m13.0s/1m0s

running (0m14.0s), 30/30 VUs, 271 complete and 0 interrupted iterations
default   [  23% ] 30 VUs  0m14.0s/1m0s

running (0m15.0s), 30/30 VUs, 300 complete and 0 interrupted iterations
default   [  25% ] 30 VUs  0m15.0s/1m0s

running (0m16.0s), 30/30 VUs, 330 complete and 0 interrupted iterations
default   [  27% ] 30 VUs  0m16.0s/1m0s

running (0m17.0s), 30/30 VUs, 359 complete and 0 interrupted iterations
default   [  28% ] 30 VUs  0m17.0s/1m0s

running (0m18.0s), 30/30 VUs, 361 complete and 0 interrupted iterations
default   [  30% ] 30 VUs  0m18.0s/1m0s

running (0m19.0s), 30/30 VUs, 390 complete and 0 interrupted iterations
default   [  32% ] 30 VUs  0m19.0s/1m0s

running (0m20.0s), 30/30 VUs, 420 complete and 0 interrupted iterations
default   [  33% ] 30 VUs  0m20.0s/1m0s

running (0m21.0s), 30/30 VUs, 450 complete and 0 interrupted iterations
default   [  35% ] 30 VUs  0m21.0s/1m0s

running (0m22.0s), 30/30 VUs, 456 complete and 0 interrupted iterations
default   [  37% ] 30 VUs  0m22.0s/1m0s

running (0m23.0s), 30/30 VUs, 480 complete and 0 interrupted iterations
default   [  38% ] 30 VUs  0m23.0s/1m0s

running (0m24.0s), 30/30 VUs, 510 complete and 0 interrupted iterations
default   [  40% ] 30 VUs  0m24.0s/1m0s

running (0m25.0s), 30/30 VUs, 540 complete and 0 interrupted iterations
default   [  42% ] 30 VUs  0m25.0s/1m0s

running (0m26.0s), 30/30 VUs, 568 complete and 0 interrupted iterations
default   [  43% ] 30 VUs  0m26.0s/1m0s

running (0m27.0s), 30/30 VUs, 571 complete and 0 interrupted iterations
default   [  45% ] 30 VUs  0m27.0s/1m0s

running (0m28.0s), 30/30 VUs, 600 complete and 0 interrupted iterations
default   [  47% ] 30 VUs  0m28.0s/1m0s

running (0m29.0s), 30/30 VUs, 630 complete and 0 interrupted iterations
default   [  48% ] 30 VUs  0m29.0s/1m0s

running (0m30.0s), 30/30 VUs, 659 complete and 0 interrupted iterations
default   [  50% ] 30 VUs  0m30.0s/1m0s

running (0m31.0s), 30/30 VUs, 666 complete and 0 interrupted iterations
default   [  52% ] 30 VUs  0m31.0s/1m0s

running (0m32.0s), 30/30 VUs, 690 complete and 0 interrupted iterations
default   [  53% ] 30 VUs  0m32.0s/1m0s

running (0m33.0s), 30/30 VUs, 720 complete and 0 interrupted iterations
default   [  55% ] 30 VUs  0m33.0s/1m0s

running (0m34.0s), 30/30 VUs, 750 complete and 0 interrupted iterations
default   [  57% ] 30 VUs  0m34.0s/1m0s

running (0m35.0s), 30/30 VUs, 775 complete and 0 interrupted iterations
default   [  58% ] 30 VUs  0m35.0s/1m0s

running (0m36.0s), 30/30 VUs, 781 complete and 0 interrupted iterations
default   [  60% ] 30 VUs  0m36.0s/1m0s

running (0m37.0s), 30/30 VUs, 810 complete and 0 interrupted iterations
default   [  62% ] 30 VUs  0m37.0s/1m0s

running (0m38.0s), 30/30 VUs, 840 complete and 0 interrupted iterations
default   [  63% ] 30 VUs  0m38.0s/1m0s

running (0m39.0s), 30/30 VUs, 868 complete and 0 interrupted iterations
default   [  65% ] 30 VUs  0m39.0s/1m0s

running (0m40.0s), 30/30 VUs, 874 complete and 0 interrupted iterations
default   [  67% ] 30 VUs  0m40.0s/1m0s

running (0m41.0s), 30/30 VUs, 900 complete and 0 interrupted iterations
default   [  68% ] 30 VUs  0m41.0s/1m0s

running (0m42.0s), 30/30 VUs, 930 complete and 0 interrupted iterations
default   [  70% ] 30 VUs  0m42.0s/1m0s

running (0m43.0s), 30/30 VUs, 960 complete and 0 interrupted iterations
default   [  72% ] 30 VUs  0m43.0s/1m0s

running (0m44.0s), 30/30 VUs, 974 complete and 0 interrupted iterations
default   [  73% ] 30 VUs  0m44.0s/1m0s

running (0m45.0s), 30/30 VUs, 991 complete and 0 interrupted iterations
default   [  75% ] 30 VUs  0m45.0s/1m0s

running (0m46.0s), 30/30 VUs, 1020 complete and 0 interrupted iterations
default   [  77% ] 30 VUs  0m46.0s/1m0s

running (0m47.0s), 30/30 VUs, 1050 complete and 0 interrupted iterations
default   [  78% ] 30 VUs  0m47.0s/1m0s

running (0m48.0s), 30/30 VUs, 1078 complete and 0 interrupted iterations
default   [  80% ] 30 VUs  0m48.0s/1m0s

running (0m49.0s), 30/30 VUs, 1084 complete and 0 interrupted iterations
default   [  82% ] 30 VUs  0m49.0s/1m0s

running (0m50.0s), 30/30 VUs, 1110 complete and 0 interrupted iterations
default   [  83% ] 30 VUs  0m50.0s/1m0s

running (0m51.0s), 30/30 VUs, 1140 complete and 0 interrupted iterations
default   [  85% ] 30 VUs  0m51.0s/1m0s

running (0m52.0s), 30/30 VUs, 1168 complete and 0 interrupted iterations
default   [  87% ] 30 VUs  0m52.0s/1m0s

running (0m53.0s), 30/30 VUs, 1184 complete and 0 interrupted iterations
default   [  88% ] 30 VUs  0m53.0s/1m0s

running (0m54.0s), 30/30 VUs, 1201 complete and 0 interrupted iterations
default   [  90% ] 30 VUs  0m54.0s/1m0s

running (0m55.0s), 30/30 VUs, 1230 complete and 0 interrupted iterations
default   [  92% ] 30 VUs  0m55.0s/1m0s

running (0m56.0s), 30/30 VUs, 1260 complete and 0 interrupted iterations
default   [  93% ] 30 VUs  0m56.0s/1m0s

running (0m57.0s), 30/30 VUs, 1282 complete and 0 interrupted iterations
default   [  95% ] 30 VUs  0m57.0s/1m0s

running (0m58.0s), 30/30 VUs, 1295 complete and 0 interrupted iterations
default   [  97% ] 30 VUs  0m58.0s/1m0s

running (0m59.0s), 30/30 VUs, 1320 complete and 0 interrupted iterations
default   [  98% ] 30 VUs  0m59.0s/1m0s

running (1m00.0s), 30/30 VUs, 1350 complete and 0 interrupted iterations
default   [ 100% ] 30 VUs  1m00.0s/1m0s

running (1m01.0s), 02/30 VUs, 1378 complete and 0 interrupted iterations
default ↓ [ 100% ] 30 VUs  1m0s


  █ TOTAL RESULTS 

    checks_total.......: 1380    22.573425/s
    checks_succeeded...: 100.00% 1380 out of 1380
    checks_failed......: 0.00%   0 out of 1380

    ✓ status 200 байна

    HTTP
    http_req_duration..............: avg=147.44ms min=53.89ms med=168.23ms max=446.39ms p(90)=237.35ms p(95)=245.57ms
      { expected_response:true }...: avg=147.44ms min=53.89ms med=168.23ms max=446.39ms p(90)=237.35ms p(95)=245.57ms
    http_req_failed................: 0.00%  0 out of 2760
    http_reqs......................: 2760   45.146849/s

    EXECUTION
    iteration_duration.............: avg=1.32s    min=1.27s   med=1.29s    max=2.47s    p(90)=1.31s    p(95)=1.33s   
    iterations.....................: 1380   22.573425/s
    vus............................: 2      min=2         max=30
    vus_max........................: 30     min=30        max=30

    NETWORK
    data_received..................: 5.3 MB 87 kB/s
    data_sent......................: 229 kB 3.8 kB/s



running (1m01.1s), 00/30 VUs, 1380 complete and 0 interrupted iterations
default ✓ [ 100% ] 30 VUs  1m0s